# Pandas Concat()
Pandas provides various facilities for easily combining together series, dataFrame and panel object

In [3]:
import pandas as pd

In [4]:
sr1 = pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [5]:
sr2 = pd.Series([3,4,5])
sr2

0    3
1    4
2    5
dtype: int64

In [7]:
pd.concat([sr1, sr2])

0    0
1    1
2    2
0    3
1    4
2    5
dtype: int64

In [9]:
df1 =pd.DataFrame({"ID" : [1,2,3,4],
            "Name" : ["A","B","C","D"],
            "Class" : [5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [12]:
df2 =pd.DataFrame({"ID" : [5,6,7,8],
            "Name" : ["A","B","C","D"],
            "Class" : [5,6,7,8]})
df2

   ID Name  Class
0   5    A      5
1   6    B      6
2   7    C      7
3   8    D      8

In [14]:
pd.concat([df1 , df2])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    A      5
1   6    B      6
2   7    C      7
3   8    D      8

In [15]:
pd.concat([df1 , df2],axis = 1)

   ID Name  Class  ID Name  Class
0   1    A      5   5    A      5
1   2    B      6   6    B      6
2   3    C      7   7    C      7
3   4    D      8   8    D      8